tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1773_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1773_H_
#define _PIC16LF1773_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define CCPIF                         68
#define SSP1IF                        69
#define TXIF                          70
#define RCIF                          71
#define ADIF                          72
#define TMR1GIF                       73
#define PIR2                          74
#define CCP2IF                        75
#define C3IF                          76
#define C4IF                          77
#define BCL1IF                        78
#define COG1IF                        79
#define C1IF                          80
#define C2IF                          81
#define OSFIF                         82
#define PIR3                          83
#define CLC1IF                        84
#define CLC2IF                        85
#define CLC3IF                        86
#define CLC4IF                        87
#define ZCDIF                         88
#define COG2IF                        89
#define PIR4                          90
#define TMR4IF                        91
#define TMR6IF                        92
#define TMR3IF                        93
#define TMR3GIF                       94
#define TMR5IF                        95
#define TMR5GIF                       96
#define TMR8IF                        97
#define PIR5                          98
#define C5IF                          99
#define C6IF                          100
#define COG3IF                        101
#define CCP7IF                        102
#define PIR6                          103
#define PWM5IF                        104
#define PWM6IF                        105
#define PWM11IF                       106
#define TMR0                          107
#define TMR1L                         108
#define TMR1L_TMR                     109
#define TMR1H                         110
#define TMR1H_TMR                     111
#define T1CON                         112
#define T1CON_TMRON                   113
#define TMR1ON                        114
#define T1CON_ON                      115
#define T1ON                          116
#define T1CON_nSYNC                   117
#define T1CON_SYNC                    118
#define nT1SYNC                       119
#define T1OSCEN                       120
#define T1CON_SOSCEN                  121
#define T1CON_OSCEN                   122
#define T1CKPS0                       123
#define T1CON_CKPS0                   124
#define T1CON_CKPS                    125
#define T1CON_CKPS1                   126
#define T1CKPS1                       127
#define T1CS0                         128
#define T1CON_CS0                     129
#define TMR1CS0                       130
#define T1CON_CS                      131
#define T1CS1                         132
#define T1CON_CS1                     133
#define TMR1CS1                       134
#define T1GCON                        135
#define T1GCON_GSS0                   136
#define T1GCON_GSS                    137
#define T1GSS0                        138
#define T1GCON_GSS1                   139
#define T1GSS1                        140
#define T1GCON_GVAL                   141
#define T1GVAL                        142
#define T1GGO_nDONE                   143
#define T1GCON_GGO_nDONE              144
#define T1GCON_GSPM                   145
#define T1GSPM                        146
#define T1GTM                         147
#define T1GCON_GTM                    148
#define T1GPOL                        149
#define T1GCON_GPOL                   150
#define T1GCON_GE                     151
#define TMR1GE                        152
#define T1GE                          153
#define TMR3L                         154
#define TMR3L_TMR                     155
#define TMR3H                         156
#define TMR3H_TMR                     157
#define T3CON                         158
#define T3CON_TMRON                   159
#define TMR3ON                        160
#define T3CON_ON                      161
#define T3ON                          162
#define nT3SYNC                       163
#define T3CON_nSYNC                   164
#define T3CON_SYNC                    165
#define T3CON_SOSCEN                  166
#define T3CON_OSCEN                   167
#define T3OSCEN                       168
#define T3CON_CKPS0                   169
#define T3CKPS0                       170
#define T3CON_CKPS                    171
#define T3CON_CKPS1                   172
#define T3CKPS1                       173
#define TMR3CS0                       174
#define T3CON_CS0                     175
#define T3CS0                         176
#define T3CON_CS                      177
#define TMR3CS1                       178
#define T3CON_CS1                     179
#define T3CS1                         180
#define T3GCON                        181
#define T3GCON_GSS0                   182
#define T3GSS0                        183
#define T3GCON_GSS                    184
#define T3GCON_GSS1                   185
#define T3GSS1                        186
#define T3GCON_GVAL                   187
#define T3GVAL                        188
#define T3GCON_GGO_nDONE              189
#define T3GGO_nDONE                   190
#define T3GSPM                        191
#define T3GCON_GSPM                   192
#define T3GCON_GTM                    193
#define T3GTM                         194
#define T3GPOL                        195
#define T3GCON_GPOL                   196
#define TMR3GE                        197
#define T3GCON_GE                     198
#define T3GE                          199
#define TRISA                         200
#define TRISA0                        201
#define TRISA1                        202
#define TRISA2                        203
#define TRISA3                        204
#define TRISA4                        205
#define TRISA5                        206
#define TRISA6                        207
#define TRISA7                        208
#define TRISB                         209
#define TRISB0                        210
#define TRISB1                        211
#define TRISB2                        212
#define TRISB3                        213
#define TRISB4                        214
#define TRISB5                        215
#define TRISB6                        216
#define TRISB7                        217
#define TRISC                         218
#define TRISC0                        219
#define TRISC1                        220
#define TRISC2                        221
#define TRISC3                        222
#define TRISC4                        223
#define TRISC5                        224
#define TRISC6                        225
#define TRISC7                        226
#define TRISE                         227
#define TRISE3                        228
#define PIE1                          229
#define TMR1IE                        230
#define TMR2IE                        231
#define CCP1IE                        232
#define CCPIE                         233
#define SSP1IE                        234
#define TXIE                          235
#define RCIE                          236
#define ADIE                          237
#define TMR1GIE                       238
#define PIE2                          239
#define CCP2IE                        240
#define C3IE                          241
#define C4IE                          242
#define BCL1IE                        243
#define COGIE                         244
#define C1IE                          245
#define C2IE                          246
#define OSFIE                         247
#define PIE3                          248
#define CLC1IE                        249
#define CLC2IE                        250
#define CLC3IE                        251
#define CLC4IE                        252
#define ZCDIE                         253
#define COG2IE                        254
#define PIE4                          255
#define TMR4IE                        256
#define TMR6IE                        257
#define TMR3IE                        258
#define TMR3GIE                       259
#define TMR5IE                        260
#define TMR5GIE                       261
#define TMR8IE                        262
#define PIE5                          263
#define C5IE                          264
#define C6IE                          265
#define COG3IE                        266
#define CCP7IE                        267
#define PIE6                          268
#define PWM5IE                        269
#define PWM6IE                        270
#define PWM11IE                       271
#define OPTION_REG                    272
#define OPTION_REG_PS                 273
#define OPTION_REG_PS0                274
#define OPTION_REG_PS1                275
#define OPTION_REG_PS2                276
#define PSA                           277
#define T0SE                          278
#define TMR0SE                        279
#define T0CS                          280
#define TMR0CS                        281
#define INTEDG                        282
#define nWPUEN                        283
#define PCON                          284
#define nBOR                          285
#define nPOR                          286
#define nRI                           287
#define nRMCLR                        288
#define nRWDT                         289
#define STKUNF                        290
#define STKOVF                        291
#define WDTCON                        292
#define SWDTEN                        293
#define WDTPS                         294
#define WDTPS0                        295
#define WDTPS1                        296
#define WDTPS2                        297
#define WDTPS3                        298
#define WDTPS4                        299
#define OSCTUNE                       300
#define TUN0                          301
#define TUN                           302
#define TUN1                          303
#define TUN2                          304
#define TUN3                          305
#define TUN4                          306
#define TUN5                          307
#define OSCCON                        308
#define SCS0                          309
#define SCS                           310
#define SCS1                          311
#define IRCF                          312
#define IRCF0                         313
#define IRCF1                         314
#define IRCF2                         315
#define IRCF3                         316
#define SPLLEN                        317
#define OSCSTAT                       318
#define HFIOFS                        319
#define LFIOFR                        320
#define MFIOFR                        321
#define HFIOFL                        322
#define HFIOFR                        323
#define OSTS                          324
#define PLLR                          325
#define SOSCR                         326
#define BORCON                        327
#define BORRDY                        328
#define BORFS                         329
#define SBOREN                        330
#define FVRCON                        331
#define ADFVR                         332
#define CDAFVR                        333
#define TSRNG                         334
#define TSEN                          335
#define FVRRDY                        336
#define FVREN                         337
#define ZCD1CON                       338
#define ZCD1INTN                      339
#define ZCD1INTP                      340
#define ZCD1POL                       341
#define ZCD1OUT                       342
#define ZCD1EN                        343
#define LATA                          344
#define LATA0                         345
#define LATA1                         346
#define LATA2                         347
#define LATA3                         348
#define LATA4                         349
#define LATA5                         350
#define LATA6                         351
#define LATA7                         352
#define LATB                          353
#define LATB0                         354
#define LATB1                         355
#define LATB2                         356
#define LATB3                         357
#define LATB4                         358
#define LATB5                         359
#define LATB6                         360
#define LATB7                         361
#define LATC                          362
#define LATC0                         363
#define LATC1                         364
#define LATC2                         365
#define LATC3                         366
#define LATC4                         367
#define LATC5                         368
#define LATC6                         369
#define LATC7                         370
#define CMOUT                         371
#define MC1OUT                        372
#define MC2OUT                        373
#define MC3OUT                        374
#define MC4OUT                        375
#define MC5OUT                        376
#define MC6OUT                        377
#define CM1CON0                       378
#define C1SYNC                        379
#define CM1CON0_SYNC                  380
#define CM1CON0_HYS                   381
#define C1HYS                         382
#define C1SP                          383
#define CM1CON0_ZLF                   384
#define C1ZLF                         385
#define CM1CON0_POL                   386
#define C1POL                         387
#define C1OUT                         388
#define CM1CON0_OUT                   389
#define CM1CON0_ON                    390
#define C1ON                          391
#define CM1CON1                       392
#define C1INTN                        393
#define CM1CON1_INTN                  394
#define CM1CON1_INTP                  395
#define C1INTP                        396
#define CM1NSEL                       397
#define C1NCH0                        398
#define CM1NSEL_NCH                   399
#define C1NCH                         400
#define C1NCH1                        401
#define C1NCH2                        402
#define C1NCH3                        403
#define CM1PSEL                       404
#define CM1PSEL_PCH                   405
#define C1PCH                         406
#define C1PCH0                        407
#define CM1PSEL_PCH0                  408
#define C1PCH1                        409
#define CM1PSEL_PCH1                  410
#define C1PCH2                        411
#define CM1PSEL_PCH2                  412
#define C1PCH3                        413
#define CM1PSEL_PCH3                  414
#define CM2CON0                       415
#define CM2CON0_SYNC                  416
#define C2SYNC                        417
#define C2HYS                         418
#define CM2CON0_HYS                   419
#define C2SP                          420
#define C2ZLF                         421
#define CM2CON0_ZLF                   422
#define C2POL                         423
#define CM2CON0_POL                   424
#define C2OUT                         425
#define CM2CON0_OUT                   426
#define CM2CON0_ON                    427
#define C2ON                          428
#define CM2CON1                       429
#define C2INTN                        430
#define CM2CON1_INTN                  431
#define CM2CON1_INTP                  432
#define C2INTP                        433
#define CM2NSEL                       434
#define C2NCH0                        435
#define CM2NSEL_NCH                   436
#define C2NCH                         437
#define C2NCH1                        438
#define C2NCH2                        439
#define C2NCH3                        440
#define CM2PSEL                       441
#define CM2PSEL_PCH                   442
#define C2PCH                         443
#define C2PCH0                        444
#define CM2PSEL_PCH0                  445
#define C2PCH1                        446
#define CM2PSEL_PCH1                  447
#define CM2PSEL_PCH2                  448
#define C2PCH2                        449
#define CM2PSEL_PCH3                  450
#define C2PCH3                        451
#define CM3CON0                       452
#define C3SYNC                        453
#define CM3CON0_SYNC                  454
#define CM3CON0_HYS                   455
#define C3HYS                         456
#define C3SP                          457
#define CM3CON0_ZLF                   458
#define C3ZLF                         459
#define CM3CON0_POL                   460
#define C3POL                         461
#define C3OUT                         462
#define CM3CON0_OUT                   463
#define CM3CON0_ON                    464
#define C3ON                          465
#define CM3CON1                       466
#define CM3CON1_INTN                  467
#define C3INTN                        468
#define CM3CON1_INTP                  469
#define C3INTP                        470
#define CM3NSEL                       471
#define CM3NSEL_NCH                   472
#define C3NCH                         473
#define C3NCH0                        474
#define C3NCH1                        475
#define C3NCH2                        476
#define C3NCH3                        477
#define CM3PSEL                       478
#define CM3PSEL_PCH0                  479
#define C3PCH                         480
#define CM3PSEL_PCH                   481
#define C3PCH0                        482
#define CM3PSEL_PCH1                  483
#define C3PCH1                        484
#define CM3PSEL_PCH2                  485
#define C3PCH2                        486
#define CM3PSEL_PCH3                  487
#define C3PCH3                        488
#define ANSELA                        489
#define ANSA0                         490
#define ANSA1                         491
#define ANSA2                         492
#define ANSA3                         493
#define ANSA4                         494
#define ANSA5                         495
#define ANSELB                        496
#define ANSB0                         497
#define ANSB1                         498
#define ANSB2                         499
#define ANSB3                         500
#define ANSB4                         501
#define ANSB5                         502
#define ANSELC                        503
#define ANSC2                         504
#define ANSC3                         505
#define ANSC4                         506
#define ANSC5                         507
#define ANSC6                         508
#define ANSC7                         509
#define PMADRL                        510
#define PMADRH                        511
#define PMDATL                        512
#define PMDATH                        513
#define PMCON1                        514
#define RD                            515
#define WR                            516
#define WREN                          517
#define WRERR                         518
#define FREE                          519
#define LWLO                          520
#define CFGS                          521
