tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1773_tdd.h
#define PMCON2                        522
#define RC1REG                        523
#define TX1REG                        524
#define SP1BRGL                       525
#define SP1BRGH                       526
#define RC1STA                        527
#define RX9D                          528
#define OERR                          529
#define FERR                          530
#define ADDEN                         531
#define CREN                          532
#define SREN                          533
#define RX9                           534
#define SPEN                          535
#define TX1STA                        536
#define TX9D                          537
#define TRMT                          538
#define BRGH                          539
#define SENDB                         540
#define TX1STA_SYNC                   541
#define TXEN                          542
#define TX9                           543
#define CSRC                          544
#define BAUD1CON                      545
#define ABDEN                         546
#define WUE                           547
#define BRG16                         548
#define SCKP                          549
#define RCIDL                         550
#define ABDOVF                        551
#define WPUA                          552
#define WPUA0                         553
#define WPUA1                         554
#define WPUA2                         555
#define WPUA3                         556
#define WPUA4                         557
#define WPUA5                         558
#define WPUA6                         559
#define WPUA7                         560
#define WPUB                          561
#define WPUB0                         562
#define WPUB1                         563
#define WPUB2                         564
#define WPUB3                         565
#define WPUB4                         566
#define WPUB5                         567
#define WPUB6                         568
#define WPUB7                         569
#define WPUC                          570
#define WPUC0                         571
#define WPUC1                         572
#define WPUC2                         573
#define WPUC3                         574
#define WPUC4                         575
#define WPUC5                         576
#define WPUC6                         577
#define WPUC7                         578
#define WPUE                          579
#define WPUE3                         580
#define SSP1BUF                       581
#define BUF                           582
#define BUF0                          583
#define SSP1BUF0                      584
#define BUF1                          585
#define SSP1BUF1                      586
#define BUF2                          587
#define SSP1BUF2                      588
#define BUF3                          589
#define SSP1BUF3                      590
#define BUF4                          591
#define SSP1BUF4                      592
#define BUF5                          593
#define SSP1BUF5                      594
#define BUF6                          595
#define SSP1BUF6                      596
#define BUF7                          597
#define SSP1BUF7                      598
#define ADD0                          599
#define ADD                           600
#define SSP1ADD0                      601
#define SSP1ADD                       602
#define ADD1                          603
#define SSP1ADD1                      604
#define ADD2                          605
#define SSP1ADD2                      606
#define ADD3                          607
#define SSP1ADD3                      608
#define ADD4                          609
#define SSP1ADD4                      610
#define ADD5                          611
#define SSP1ADD5                      612
#define ADD6                          613
#define SSP1ADD6                      614
#define ADD7                          615
#define SSP1ADD7                      616
#define SSP1MSK0                      617
#define SSP1MSK                       618
#define MSK0                          619
#define MSK                           620
#define SSP1MSK1                      621
#define MSK1                          622
#define SSP1MSK2                      623
#define MSK2                          624
#define SSP1MSK3                      625
#define MSK3                          626
#define SSP1MSK4                      627
#define MSK4                          628
#define SSP1MSK5                      629
#define MSK5                          630
#define SSP1MSK6                      631
#define MSK6                          632
#define SSP1MSK7                      633
#define MSK7                          634
#define SSP1STAT                      635
#define BF                            636
#define UA                            637
#define R_nW                          638
#define S                             639
#define P                             640
#define D_nA                          641
#define CKE                           642
#define SMP                           643
#define SSP1CON1                      644
#define SSPM0                         645
#define SSPM                          646
#define SSPM1                         647
#define SSPM2                         648
#define SSPM3                         649
#define CKP                           650
#define SSPEN                         651
#define SSPOV                         652
#define WCOL                          653
#define SSP1CON2                      654
#define SEN                           655
#define RSEN                          656
#define PEN                           657
#define RCEN                          658
#define ACKEN                         659
#define ACKDT                         660
#define ACKSTAT                       661
#define GCEN                          662
#define SSP1CON3                      663
#define DHEN                          664
#define AHEN                          665
#define SBCDE                         666
#define SDAHT                         667
#define BOEN                          668
#define SCIE                          669
#define PCIE                          670
#define ACKTIM                        671
#define MD3CON0                       672
#define MD3BIT                        673
#define MD3CON0_BIT                   674
#define MD3CON0_OPOL                  675
#define MD3OPOL                       676
#define MD3CON0_OUT                   677
#define MD3OUT                        678
#define MD3EN                         679
#define MD3CON0_EN                    680
#define MD3CON1                       681
#define MD3CLSYNC                     682
#define MD3CON1_CLSYNC                683
#define MD3CLPOL                      684
#define MD3CON1_CLPOL                 685
#define MD3CON1_CHSYNC                686
#define MD3CHSYNC                     687
#define MD3CON1_CHPOL                 688
#define MD3CHPOL                      689
#define MD3SRC                        690
#define MD3SRC_MS                     691
#define MD3MS0                        692
#define MD3SRC_MS0                    693
#define MD3MS                         694
#define MD3SRC_MS1                    695
#define MD3MS1                        696
#define MD3SRC_MS2                    697
#define MD3MS2                        698
#define MD3SRC_MS3                    699
#define MD3MS3                        700
#define MD3SRC_MS4                    701
#define MD3MS4                        702
#define MD3CARL                       703
#define MD3CARL_CL0                   704
#define MD3CL                         705
#define MD3CARL_CL                    706
#define MD3CL0                        707
#define MD3CL1                        708
#define MD3CARL_CL1                   709
#define MD3CARL_CL2                   710
#define MD3CL2                        711
#define MD3CARL_CL3                   712
#define MD3CL3                        713
#define MD3CARL_CL4                   714
#define MD3CARH                       715
#define MD3CARH_CH                    716
#define MD3CARH_CH0                   717
#define MD3CH                         718
#define MD3CH0                        719
#define MD3CARH_CH1                   720
#define MD3CH1                        721
#define MD3CARH_CH2                   722
#define MD3CH2                        723
#define MD3CARH_CH3                   724
#define MD3CH3                        725
#define MD3CARH_CH4                   726
#define ODCONA                        727
#define ODCONA_ODA0                   728
#define ODCONA_ODA1                   729
#define ODCONA_ODA2                   730
#define ODCONA_ODA3                   731
#define ODA4                          732
#define ODA5                          733
#define ODA6                          734
#define ODA7                          735
#define ODCONB                        736
#define ODCONB_ODA0                   737
#define ODCONB_ODA1                   738
#define ODCONB_ODA2                   739
#define ODCONB_ODA3                   740
#define ODB4                          741
#define ODB5                          742
#define ODB6                          743
#define ODB7                          744
#define ODCONC                        745
#define ODC0                          746
#define ODC1                          747
#define ODC2                          748
#define ODC3                          749
#define ODC4                          750
#define ODC5                          751
#define ODC6                          752
#define ODC7                          753
#define CCPR1L                        754
#define CCPR1L_RL                     755
#define CCPR1H                        756
#define CCPR1H_RH                     757
#define CCP1CON                       758
#define CCP1CON_MODE                  759
#define CCP1MODE0                     760
#define CCP1CON_MODE0                 761
#define CCP1MODE                      762
#define CCP1MODE1                     763
#define CCP1CON_MODE1                 764
#define CCP1MODE2                     765
#define CCP1CON_MODE2                 766
#define CCP1MODE3                     767
#define CCP1CON_MODE3                 768
#define CCP1CON_FMT                   769
#define CCP1FMT                       770
#define CCP1CON_OUT                   771
#define CCP1OUT                       772
#define CCP1EN                        773
#define CCP1CON_EN                    774
#define CCP1CAP                       775
#define CCP1CTS0                      776
#define CCP1CAP_CTS                   777
#define CCP1CAP_CTS0                  778
#define CCP1CTS                       779
#define CCP1CTS1                      780
#define CCP1CAP_CTS1                  781
#define CCP1CTS2                      782
#define CCP1CAP_CTS2                  783
#define CCP1CTS3                      784
#define CCP1CAP_CTS3                  785
#define CCPR2L                        786
#define CCPR2L_RL                     787
#define CCPR2H                        788
#define CCPR2H_RH                     789
#define CCP2CON                       790
#define CCP2MODE                      791
#define CCP2MODE0                     792
#define CCP2CON_MODE0                 793
#define CCP2CON_MODE                  794
#define CCP2MODE1                     795
#define CCP2CON_MODE1                 796
#define CCP2MODE2                     797
#define CCP2CON_MODE2                 798
#define CCP2MODE3                     799
#define CCP2CON_MODE3                 800
#define CCP2FMT                       801
#define CCP2CON_FMT                   802
#define CCP2OUT                       803
#define CCP2CON_OUT                   804
#define CCP2EN                        805
#define CCP2CON_EN                    806
#define CCP2CAP                       807
#define CCP2CAP_CTS                   808
#define CCP2CAP_CTS0                  809
#define CCP2CTS                       810
#define CCP2CTS0                      811
#define CCP2CAP_CTS1                  812
#define CCP2CTS1                      813
#define CCP2CAP_CTS2                  814
#define CCP2CTS2                      815
#define CCP2CAP_CTS3                  816
#define CCP2CTS3                      817
#define CCPR7L                        818
#define CCPR7L_RL                     819
#define CCPR7H                        820
#define CCPR7H_RH                     821
#define CCP7CON                       822
#define CCP7CON_MODE0                 823
#define CCP7CON_MODE                  824
#define CCP7MODE0                     825
#define CCP7MODE                      826
#define CCP7CON_MODE1                 827
#define CCP7MODE1                     828
#define CCP7CON_MODE2                 829
#define CCP7MODE2                     830
#define CCP7CON_MODE3                 831
#define CCP7MODE3                     832
#define CCP7CON_FMT                   833
#define CCP7FMT                       834
#define CCP7CON_OUT                   835
#define CCP7OUT                       836
#define CCP7EN                        837
#define CCP7CON_EN                    838
#define CCP7CAP                       839
#define CCP7CTS                       840
#define CCP7CAP_CTS0                  841
#define CCP7CAP_CTS                   842
#define CCP7CTS0                      843
#define CCP7CTS1                      844
#define CCP7CAP_CTS1                  845
#define CCP7CTS2                      846
#define CCP7CAP_CTS2                  847
#define CCP7CAP_CTS3                  848
#define CCP7CTS3                      849
#define CCPTMRS1                      850
#define C1TSEL0                       851
#define C1TSEL                        852
#define C1TSEL1                       853
#define C2TSEL0                       854
#define C2TSEL                        855
#define C2TSEL1                       856
#define C7TSEL                        857
#define C7TSEL0                       858
#define C7TSEL1                       859
#define CCPTMRS2                      860
#define P3TSEL                        861
#define P3TSEL0                       862
#define P3TSEL1                       863
#define P4TSEL0                       864
#define P4TSEL                        865
#define P5TSEL1                       866
#define P9TSEL0                       867
#define P9TSEL                        868
#define P9TSEL1                       869
#define SLRCONA                       870
#define SLRA0                         871
#define SLRA1                         872
#define SLRA2                         873
#define SLRA3                         874
#define SLRA4                         875
#define SLRA5                         876
#define SLRA6                         877
#define SLRA7                         878
#define SLRCONB                       879
#define SLRB0                         880
#define SLRB1                         881
#define SLRB2                         882
#define SLRB3                         883
#define SLRB4                         884
#define SLRB5                         885
#define SLRB6                         886
#define SLRB7                         887
#define SLRCONC                       888
#define SLRC0                         889
#define SLRC1                         890
#define SLRC2                         891
#define SLRC3                         892
#define SLRC4                         893
#define SLRC5                         894
#define SLRC6                         895
#define SLRC7                         896
#define MD1CON0                       897
#define MD1BIT                        898
#define MD1CON0_BIT                   899
#define MD1OPOL                       900
#define MD1CON0_OPOL                  901
#define MD1CON0_OUT                   902
#define MD1OUT                        903
#define MD1CON0_EN                    904
#define MD1EN                         905
#define MD1CON1                       906
#define MD1CLSYNC                     907
#define MD1CON1_CLSYNC                908
#define MD1CON1_CLPOL                 909
#define MD1CLPOL                      910
#define MD1CON1_CHSYNC                911
#define MD1CHSYNC                     912
#define MD1CHPOL                      913
#define MD1CON1_CHPOL                 914
#define MD1SRC                        915
#define MD1MS0                        916
#define MD1SRC_MS0                    917
#define MD1MS                         918
#define MD1SRC_MS                     919
#define MD1MS1                        920
#define MD1SRC_MS1                    921
#define MD1MS2                        922
#define MD1SRC_MS2                    923
#define MD1MS3                        924
#define MD1SRC_MS3                    925
#define MD1MS4                        926
#define MD1SRC_MS4                    927
#define MD1CARL                       928
#define MD1CL                         929
#define MD1CARL_CL0                   930
#define MD1CL0                        931
#define MD1CARL_CL                    932
#define MD1CARL_CL1                   933
#define MD1CL1                        934
#define MD1CARL_CL2                   935
#define MD1CL2                        936
#define MD1CARL_CL3                   937
#define MD1CL3                        938
#define MD1CARL_CL4                   939
#define MD1CARH                       940
#define MD1CARH_CH                    941
#define MD1CH                         942
#define MD1CH0                        943
#define MD1CARH_CH0                   944
#define MD1CH1                        945
#define MD1CARH_CH1                   946
#define MD1CH2                        947
#define MD1CARH_CH2                   948
#define MD1CH3                        949
#define MD1CARH_CH3                   950
#define MD1CARH_CH4                   951
#define MD2CON0                       952
#define MD2BIT                        953
#define MD2CON0_BIT                   954
#define MD2CON0_OPOL                  955
#define MD2OPOL                       956
#define MD2CON0_OUT                   957
#define MD2OUT                        958
#define MD2CON0_EN                    959
#define MD2EN                         960
#define MD2CON1                       961
#define MD2CLSYNC                     962
#define MD2CON1_CLSYNC                963
#define MD2CON1_CLPOL                 964
#define MD2CLPOL                      965
#define MD2CON1_CHSYNC                966
#define MD2CHSYNC                     967
#define MD2CHPOL                      968
#define MD2CON1_CHPOL                 969
#define MD2SRC                        970
#define MD2MS                         971
#define MD2MS0                        972
#define MD2SRC_MS0                    973
#define MD2SRC_MS                     974
#define MD2SRC_MS1                    975
#define MD2MS1                        976
#define MD2MS2                        977
#define MD2SRC_MS2                    978
#define MD2MS3                        979
#define MD2SRC_MS3                    980
#define MD2MS4                        981
#define MD2SRC_MS4                    982
#define MD2CARL                       983
#define MD2CARL_CL                    984
#define MD2CL0                        985
#define MD2CARL_CL0                   986
#define MD2CL                         987
#define MD2CARL_CL1                   988
#define MD2CL1                        989
#define MD2CL2                        990
#define MD2CARL_CL2                   991
#define MD2CL3                        992
#define MD2CARL_CL3                   993
#define MD2CARL_CL4                   994
#define MD2CARH                       995
#define MD2CARH_CH0                   996
#define MD2CH0                        997
#define MD2CARH_CH                    998
#define MD2CH                         999
#define MD2CARH_CH1                   1000
#define MD2CH1                        1001
#define MD2CARH_CH2                   1002
#define MD2CH2                        1003
#define MD2CARH_CH3                   1004
#define MD2CH3                        1005
#define MD2CARH_CH4                   1006
#define INLVLA                        1007
#define INLVLA0                       1008
#define INLVLA1                       1009
#define INLVLA2                       1010
#define INLVLA3                       1011
#define INLVLA4                       1012
#define INLVLA5                       1013
#define INLVA6                        1014
#define INLVA7                        1015
#define INLVLB                        1016
#define INLVB0                        1017
#define INLVB1                        1018
#define INLVB2                        1019
#define INLVB3                        1020
#define INLVLB4                       1021
#define INLVLB5                       1022
#define INLVLB6                       1023
#define INLVLB7                       1024
#define INLVLC                        1025
#define INLVLC0                       1026
#define INLVLC1                       1027
#define INLVLC2                       1028
#define INLVLC3                       1029
#define INLVLC4                       1030
#define INLVLC5                       1031
#define INLVLC6                       1032
#define INLVLC7                       1033
#define INLVE                         1034
#define INLVE3                        1035
#define IOCAP                         1036
#define IOCAP0                        1037
#define IOCAP1                        1038
#define IOCAP2                        1039
#define IOCAP3                        1040
#define IOCAP4                        1041
#define IOCAP5                        1042
#define IOCAP6                        1043
#define IOCAP7                        1044
#define IOCAN                         1045
#define IOCAN0                        1046
#define IOCAN1                        1047
#define IOCAN2                        1048
#define IOCAN3                        1049
#define IOCAN4                        1050
#define IOCAN5                        1051
#define IOCAN6                        1052
#define IOCAN7                        1053
#define IOCAF                         1054
#define IOCAF0                        1055
#define IOCAF1                        1056
#define IOCAF2                        1057
#define IOCAF3                        1058
#define IOCAF4                        1059
#define IOCAF5                        1060
#define IOCAF6                        1061
#define IOCAF7                        1062
#define IOCBP                         1063
#define IOCBP0                        1064
#define IOCBP1                        1065
#define IOCBP2                        1066
#define IOCBP3                        1067
#define IOCBP4                        1068
#define IOCBP5                        1069
#define IOCBP6                        1070
#define IOCBP7                        1071
#define IOCBN                         1072
#define IOCBN0                        1073
#define IOCBN1                        1074
#define IOCBN2                        1075
#define IOCBN3                        1076
#define IOCBN4                        1077
#define IOCBN5                        1078
#define IOCBN6                        1079
#define IOCBN7                        1080
#define IOCBF                         1081
#define IOCBF0                        1082
#define IOCBF1                        1083
#define IOCBF2                        1084
#define IOCBF3                        1085
#define IOCBF4                        1086
#define IOCBF5                        1087
#define IOCBF6                        1088
#define IOCBF7                        1089
#define IOCCP                         1090
