tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1773_tdd.h
#define LC4POL                        4439
#define CLC4POL_POL                   4440
#define CLC4SEL0                      4441
#define CLC4SEL0_D1S0                 4442
#define LC4D1S0                       4443
#define CLC4SEL0_D1S                  4444
#define LC4D1S                        4445
#define CLC4SEL0_D1S1                 4446
#define LC4D1S1                       4447
#define CLC4SEL0_D1S2                 4448
#define LC4D1S2                       4449
#define CLC4SEL0_D1S3                 4450
#define LC4D1S3                       4451
#define CLC4SEL0_D1S4                 4452
#define LC4D1S4                       4453
#define CLC4SEL0_D1S5                 4454
#define LC4D1S5                       4455
#define CLC4SEL1                      4456
#define LC4D2S0                       4457
#define CLC4SEL1_D2S                  4458
#define CLC4SEL1_D2S0                 4459
#define LC4D2S                        4460
#define CLC4SEL1_D2S1                 4461
#define LC4D2S1                       4462
#define LC4D2S2                       4463
#define CLC4SEL1_D2S2                 4464
#define LC4D2S3                       4465
#define CLC4SEL1_D2S3                 4466
#define LC4D2S4                       4467
#define CLC4SEL1_D2S4                 4468
#define LC4D2S5                       4469
#define CLC4SEL1_D2S5                 4470
#define CLC4SEL2                      4471
#define LC4D3S                        4472
#define CLC4SEL2_D3S                  4473
#define CLC4SEL2_D3S0                 4474
#define LC4D3S0                       4475
#define LC4D3S1                       4476
#define CLC4SEL2_D3S1                 4477
#define CLC4SEL2_D3S2                 4478
#define LC4D3S2                       4479
#define CLC4SEL2_D3S3                 4480
#define LC4D3S3                       4481
#define CLC4SEL2_D3S4                 4482
#define LC4D3S4                       4483
#define CLC4SEL2_D3S5                 4484
#define LC4D3S5                       4485
#define CLC4SEL3                      4486
#define LC4D4S0                       4487
#define LC4D4S                        4488
#define CLC4SEL3_D4S0                 4489
#define CLC4SEL3_D4S                  4490
#define LC4D4S1                       4491
#define CLC4SEL3_D4S1                 4492
#define LC4D4S2                       4493
#define CLC4SEL3_D4S2                 4494
#define LC4D4S3                       4495
#define CLC4SEL3_D4S3                 4496
#define LC4D4S4                       4497
#define CLC4SEL3_D4S4                 4498
#define LC4D4S5                       4499
#define CLC4SEL3_D4S5                 4500
#define CLC4GLS0                      4501
#define CLC4GLS0_D1N                  4502
#define LC4G1D1N                      4503
#define CLC4GLS0_D1T                  4504
#define LC4G1D1T                      4505
#define CLC4GLS0_D2N                  4506
#define LC4G1D2N                      4507
#define CLC4GLS0_D2T                  4508
#define LC4G1D2T                      4509
#define CLC4GLS0_D3N                  4510
#define LC4G1D3N                      4511
#define CLC4GLS0_D3T                  4512
#define LC4G1D3T                      4513
#define CLC4GLS0_D4N                  4514
#define LC4G1D4N                      4515
#define CLC4GLS0_D4T                  4516
#define LC4G1D4T                      4517
#define CLC4GLS1                      4518
#define CLC4GLS1_D1N                  4519
#define LC4G2D1N                      4520
#define CLC4GLS1_D1T                  4521
#define LC4G2D1T                      4522
#define LC4G2D2N                      4523
#define CLC4GLS1_D2N                  4524
#define LC4G2D2T                      4525
#define CLC4GLS1_D2T                  4526
#define CLC4GLS1_D3N                  4527
#define LC4G2D3N                      4528
#define LC4G2D3T                      4529
#define CLC4GLS1_D3T                  4530
#define CLC4GLS1_D4N                  4531
#define LC4G2D4N                      4532
#define CLC4GLS1_D4T                  4533
#define LC4G2D4T                      4534
#define CLC4GLS2                      4535
#define CLC4GLS2_D1N                  4536
#define LC4G3D1N                      4537
#define CLC4GLS2_D1T                  4538
#define LC4G3D1T                      4539
#define LC4G3D2N                      4540
#define CLC4GLS2_D2N                  4541
#define LC4G3D2T                      4542
#define CLC4GLS2_D2T                  4543
#define CLC4GLS2_D3N                  4544
#define LC4G3D3N                      4545
#define CLC4GLS2_D3T                  4546
#define LC4G3D3T                      4547
#define LC4G3D4N                      4548
#define CLC4GLS2_D4N                  4549
#define LC4G3D4T                      4550
#define CLC4GLS2_D4T                  4551
#define CLC4GLS3                      4552
#define CLC4GLS3_G4D1N                4553
#define LC4G4D1N                      4554
#define LC4G4D1T                      4555
#define CLC4GLS3_G4D1T                4556
#define LC4G4D2N                      4557
#define CLC4GLS3_G4D2N                4558
#define LC4G4D2T                      4559
#define CLC4GLS3_G4D2T                4560
#define CLC4GLS3_G4D3N                4561
#define LC4G4D3N                      4562
#define CLC4GLS3_G4D3T                4563
#define LC4G4D3T                      4564
#define LC4G4D4N                      4565
#define CLC4GLS3_G4D4N                4566
#define LC4G4D4T                      4567
#define CLC4GLS3_G4D4T                4568
#define STATUS_SHAD                   4569
#define C_SHAD                        4570
#define DC_SHAD                       4571
#define Z_SHAD                        4572
#define WREG_SHAD                     4573
#define BSR_SHAD                      4574
#define PCLATH_SHAD                   4575
#define FSR0L_SHAD                    4576
#define FSR0H_SHAD                    4577
#define FSR1L_SHAD                    4578
#define FSR1H_SHAD                    4579
#define STKPTR                        4580
#define TOSL                          4581
#define TOSH                          4582

#endif // _PIC16LF1773_H_
